/*******************************************************************************
** 文件名: 		ae_Comp.c
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM 5.20
** 作者: 		  aelab
** 生成日期: 	2015-08-21
** 功能:		  互补滤波函数
** 相关文件:	ae_I2C.c
							ae_usart.c
							SysTickDelay.c
							ae_mpu6050.c
							ae_Angle.c
** 修改日志：	2015-08-21   创建文档
*******************************************************************************/
/* 包含头文件 *****************************************************************/
#include "stm32f10x.h"
#include "math.h"
#include "SysTickDelay.h"
#include "ae_Com.h"
#include "ae_Angle.h"


/* 变量 ----------------------------------------------------------------------*/

uint16_t FirstFlag = 1;               //第一次运行互补滤波函数标志位
	


/*******************************************************************************
  * @函数名称	  Comp_Angle
  * @函数说明   通过补偿滤波获得角度
  * @输入参数   无
  * @输出参数   无
  * @返回参数   无
  *****************************************************************************/
void Comp_Angle(void)
{
		
		if(FirstFlag == 1)         
		{
			FirstFlag = 0;                
			AngleComp = AngleXacc;       //首次使用加速度传感器计算的倾角
		}
		else
		{
			AngleComp = Coefficient*(AngleComp + (XgyroRate-XgyroRateZero)*SamplePeriod*0.0001f) + (1 - Coefficient)*AngleXacc;  //互补算法
	 /**最终结果*****比例系数***上一次结果****角速度****零飘校准*******采样周期***************************加速度计算值**/    
		}
}




